print("Я подсчитаю свою живность:")

# подсчет куриц, петухов
print("Куры", 25.0 + 30.0 / 6.0)
print("Петухи", 100.0 - 25.0 * 3.0 % 4.0)
print("А теперь подсчитаю яйца:")

#подсчет яиц
print (round(3.0 + 2.0 + 1.0 - 5.0 + 4 % 2 - 1.0 / 4.0 + 6.0))
print("Bepно ли, что 3 + 2 < 5 - 7?")
print(3 + 2 < 5 - 7)
print("Сколько будет 3 + 2?", 3 + 2 )
print("A сколько будет 5 - 7?", 5 - 7 )
print("Ой, я, кажется, запутался... Почему False?")
print("Еще раз посчитаю...")
print("Это больше?", 5 > -2)
print("A это больше или равно?", 5 >= -2)
print("A это меньше или равно?", 5 <= -2)