animals = ['медведь', 'питон', 'пингвин', 'кенгуру', 'кит', 'утконос']

num_animals = [1, 2, 3, 4, 5, 6]

num = [0, 1, 2, 3, 4, 5]



print(f"Первое животное имеет индекс {num[0]} и это {animals[0]}")
print(f"Животное с индексом {num[0]} является {num_animals[0]}, и это {animals[0]}")

print(f"Первое животное имеет индекс {num[1]} и это {animals[1]}")
print(f"Животное с индексом {num[1]} является {num_animals[1]}, и это {animals[1]}")

print(f"Первое животное имеет индекс {num[2]} и это {animals[2]}")
print(f"Животное с индексом {num[2]} является {num_animals[2]}, и это {animals[2]}")

print(f"Первое животное имеет индекс {num[3]} и это {animals[3]}")
print(f"Животное с индексом {num[3]} является {num_animals[3]}, и это {animals[3]}")

print(f"Первое животное имеет индекс {num[4]} и это {animals[4]}")
print(f"Животное с индексом {num[4]} является {num_animals[4]}, и это {animals[4]}")

print(f"Первое животное имеет индекс {num[5]} и это {animals[5]}")
print(f"Животное с индексом {num[5]} является {num_animals[5]}, и это {animals[5]}")