#       вш1                                 вш2
#        |                                   |
# __________________________________________________
# (_________________________________________________)
#      ()
#      |              ___________            | Д
#      |_________()  |бункер     |           | Е
#       _____        |___________|           | П
#       |кпп|________________________________| О
#  ______|__________________________________________
# (_________________________________________________)
#        |                                   |
#       вш3                                 вш4
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
import time
from sys import exit
def dead():
    print("Тебя поймали монтеры.")
    exit(0)

def bunker():
    print("Тут сус, боно, биг бро. Да вообще все")

def luk():
    print("Полезем в люк?")
    print("\n(1)Да\t(2)Нет")